denghengli/stm32f429-rtthread4.0.2-webnet/board/CubeMX_Config/Src/TouchGFXConfiguration.cpp
/**
******************************************************************************
* File Name : TouchGFXConfiguration.cpp
******************************************************************************
* @attention
*
* <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
* All rights reserved.</center></h2>
*
* This software component is licensed by ST under Ultimate Liberty license
* SLA0044, the "License"; You may not use this file except in compliance with
* the License. You may obtain a copy of the License at:
* www.st.com/SLA0044
*
******************************************************************************
*/
#include <texts/TypedTextDatabase.hpp>
#include <fonts/ApplicationFontProvider.hpp>
#include <gui/common/FrontendHeap.hpp>
#include <BitmapDatabase.hpp>
#include <platform/driver/lcd/LCD16bpp.hpp>
#include <STM32DMA.hpp>
#include <TouchGFXHAL.hpp>
#include <STM32TouchController.hpp>
#include <stm32f4xx_hal.h>

extern "C" void touchgfx_init();
extern "C" void touchgfx_taskEntry();

//static TouchGFXDataReader dataReader;
//static LCD16bppSerialFlash display(dataReader); FlashDataReader

static STM32TouchController tc;
static STM32F4DMA dma;
static LCD16bpp display;
static ApplicationFontProvider fontProvider;
static Texts texts;
static TouchGFXHAL hal(dma, display, tc, 800, 480);

void touchgfx_init()
{
	Bitmap::registerBitmapDatabase(BitmapDatabase::getInstance(), BitmapDatabase::getInstanceSize());
	TypedText::registerTexts(&texts);
	Texts::setLanguage(0);
//	fontProvider.setFlashReader(&dataReader);
	
	FontManager::setFontProvider(&fontProvider);

	FrontendHeap& heap = FrontendHeap::getInstance();
	(void)heap; // we need to obtain the reference above to initialize the frontend heap.

	hal.initialize();

	Bitmap::setCache((uint16_t *)0xC0300000,0x400000,128);
	Bitmap::cacheAll();
	
}

void touchgfx_taskEntry()
{
	/*
	* Main event loop. Will wait for VSYNC signal, and then process next frame. Call
	* this function from your GUI task.
	*
	* Note This function never returns
	*/
	
	hal.taskEntry();
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
